Repository: IBM/watson-translator-101
Catalog: en-fr-6000-ParallelCorpus.tmx
Source language: en
Languages: fr

source: The lawfulness of the statutes creating criminal offences and of penal sanctions is recognized by the Constitution of 18 September 1992.
fr: La légalité des incriminations et des sanctions pénales est reconnue par la Constitution du 18 septembre 1992.

source: Article 13 stipulates that “no one may be prosecuted, arrested or detained except in cases determined by law and according to the forms prescribed by law” and that “no one may be punished except by virtue of a law promulgated and published prior to the commission of the punishable act”.
fr: b) «Nul ne peut être puni qu'en vertu d'une loi promulguée et publiée antérieurement à la commission de l'acte punissable.».

source: These constitutional provisions are echoed by article 4 of the Criminal Code: “No misdemeanour, offence or crime shall be punished except as established by law prior to the commission thereof.”
fr: Ces dispositions constitutionnelles ont été reprises par l'article 4 du Code pénal en ces termes: «Nulle contravention, nul délit, nul crime, ne peuvent être punis de peines qui n'étaient pas prononcées par la loi avant qu'ils fussent commis».

source: Efforts have been made to eradicate certain customary practices that provide for penalties not stipulated in the criminal law.
fr: Des efforts ont été déployés pour éradiquer certaines pratiques coutumières infligeant des peines non prévues par la loi pénale.

source: Thus, article 7 of Act No. 2001-004 of 25 October 2001 on the general regulation of Dina in reference to public safety states: “The Dina shall become enforceable only after it has been approved by the competent court of law or the court of appeal and made public by posting in a public place, public announcement or some other form of publicity.”
fr: Ainsi, la loi no 2001-004 du 25 octobre 2001 portant réglementation générale des «Dina» en matière de sécurité publique dispose en son article 7: «Le Dina ne devient exécutoire qu'après son homologation par le tribunal de l'ordre judiciaire compétent ou la cour d'appel ainsi que sa publication par voie d'affichage, de discours d'information ou par tout autre mode de publicité.».

source: Through this Act, the State exercises prior control over the lawfulness of penalties prescribed by Dina.
fr: Par cette loi, l'État entend exercer un contrôle préalable de légalité concernant les sanctions édictées dans le cadre de l'application des Dina.

source: Consequently, a criminal penalty that is unlawful and contrary to the Covenant will not be approved.
fr: En conséquence, une sanction pénale non conforme à la loi et au Pacte ne sera pas homologuée.

source: The principles of non-retroactivity of criminal laws and application of the least onerous penalty, as prescribed in the Covenant, are recognized under the Constitution and applied by the criminal courts.
fr: Le principe de la non-rétroactivité des lois pénales et celui de l'application de la peine plus douce, énoncés dans le Pacte, sont reconnus par la Constitution et appliqués par les juridictions répressives.

source: Right to recognition as a person before the law
fr: Droit à la reconnaissance de la personnalité juridique

source: The recognition of everyone as a person before the law implies the assignment of certain attributes to each individual to distinguish them from their fellow-citizens.
fr: La reconnaissance de la personnalité juridique à tout être humain implique qu'un certain nombre d'attributs puissent être affectés à un individu et le distinguent ainsi des autres citoyens.

source: This recognition is denoted by the individual's civil status.
fr: Cette reconnaissance est constatée par l'état civil.

source: Recognition before the law ensures protection for individual rights under the Covenant, whether these be property or other rights.
fr: La personnalité juridique confère à l'individu le bénéfice d'une protection des droits visés par le Pacte à faire valoir ses droits patrimoniaux et/ou extrapatrimoniaux.

source: Progress has been made in the area of recognition of legal status thanks to an operation to provide a court ruling in place of a birth certificate to anyone not registered at birth.
fr: Les progrès réalisés dans le domaine de la reconnaissance de la personnalité juridique sont concrétisés par la mise en œuvre d'une opération de délivrance de jugements supplétifs de naissance au profit de toute personne non enregistrée à la naissance.

source: The acquisition of civil status facilitates the exercise, enjoyment and protection of the civil and political rights recognized under the Covenant.
fr: La possession d'état civil facilite l'exercice, la jouissance et la protection des droits civils et politiques préconisés par le Pacte.

source: The UNICEF-funded operation to ensure that every child has evidence of their civil status also plays an important part in the implementation of the Education for All policy.
fr: L'opération «délivrance de copie de naissance à tout enfant» financée par l'UNICEF apporte un appui à la réalisation de la politique «Éducation pour tous».

source: Right to protection of privacy
fr: Droit à la protection de la vie privée

source: The inviolability of the individual's person, home and correspondence is protected under article 13, paragraphs 1 and 2, of the Constitution.
fr: La protection de l'inviolabilité de la personne, du domicile et de la correspondance est visée par les paragraphes 1 et 2 de l'article 13 de la Constitution.

source: The inviolability of the person is a safeguard against any violation of the individual's physical and psychological integrity or honour.
fr: L'inviolabilité de la personne garantit une protection contre toute atteinte à l'intégrité physique, morale et à l'honneur.

source: Violations of these rights are punishable by law; the law also recognizes the right to reparation in the form of compensation for any harm suffered.
fr: La législation sanctionne les atteintes à ces violations et reconnaît le droit à réparation sous forme d'indemnisation en raison des préjudices subis.

source: Interference with the home is punishable under article 184 of the Criminal Code, except in cases provided for by the Constitution and the law.
fr: La violation de domicile est punie par l'article 184 du Code pénal malgache. Les restrictions admises sont prévues par la Constitution et la loi.

source: Under the Constitution, “no search may take place except in accordance with the law and on the written order of the competent judicial authority, except in cases of flagrante delicto”.
fr: Selon la Constitution, «Nulle perquisition ne peut avoir lieu qu'en vertu d'une loi et sur ordre d'une autorité compétente, hormis le cas de flagrant délit».

source: Under article 259 of the Code of Criminal Procedure, “no search or inspection of a home may commence before 5 a.m. or after 7 p.m.”.
fr: L'article 259 du Code de procédure pénale précise qu'«aucune perquisition ou visite domiciliaire ne peut être commencée avant 5 heures et après 19 heures».

source: Any search begun before 7 p.m. may be completed.
fr: a) De crime ou délit contre la sûreté intérieure de l'État;

source: Night searches are authorized in cases of (a) crimes or offences against internal State security, (b) flagrante delicto, and (c) narcotics operations, under article 119 of Act No. 97-039 of 4 November 1997 on the control of narcotics and psychotropic substances in Madagascar.
fr: c) De lutte contre les stupéfiants: article 119 de la loi no 97-039 du 4 novembre 1997 sur le contrôle des stupéfiants et des substances psychotropes à Madagascar.

source: Attacks on honour or reputation are the subject of a special law on media offences, while interference with correspondence is covered by the Criminal Code.
fr: La répression des atteintes à la réputation et à l'honneur font l'objet d'un texte particulier relatif au délit de presse, tandis que la violation de correspondance est prévue par le Code pénal.

source: Attacks on honour
fr: Les atteintes à l'honneur

source: Article 85, paragraph 1, of Act No. 90-031 of 21 December 1990 on communications states that “defamation of private individuals … shall be punishable by a prison term of one to six months and/or a fine of FMG 30,000 to 1 million”.
fr: «La diffamation commise envers les particuliers (…) sera punie d'un emprisonnement d'un mois à six mois et d'une amende de 30 000 à 1 000 000 de FMG ou l'une de ces deux peines seulement.».

source: Interference with correspondence
fr: La violation de correspondance

source: Tampering with correspondence is punishable under article 187 of the Criminal Code, which states the following:
fr: La violation de correspondance est sanctionnée par l'article 187 du Code pénal ainsi libellé:

source: “Any withholding or opening of a letter entrusted to the postal service, or any facilitation thereof, by any employee or official of the Government or the postal administration, shall be punishable by a fine of 25,000 to 150,000 francs and three months' to five years' imprisonment.
fr: «Toute suppression, toute ouverture de lettre confiée à la poste, commise ou facilitée par un fonctionnaire ou agent du Gouvernement ou de l'administration de la poste, sera punie d'une amende de 25 000 à 150 000 francs, et d'un emprisonnement de trois mois à cinq ans.

source: The offender shall also be barred from holding any public office or employment for a period of not less than 5 and not more than 10 years.
fr: Le coupable sera de plus interdit de toute fonction ou emploi public pendant cinq ans au moins et dix ans au plus.

source: In addition to the cases referred to in the first paragraph of this article, any malicious withholding or opening of correspondence addressed to third parties shall be punishable by a prison term of six days to one year and/or a fine of 25,000 to 150,000 francs.”
fr: En dehors des cas prévus au paragraphe premier du présent article, toute suppression, toute ouverture de correspondance adressée à des tiers, faite de mauvaise foi, sera punie d'un emprisonnement de six jours à un an et d'une amende de 25 000 à 150 000 francs ou de l'une de ces peines seulement.».

source: Monitoring of telephone communications is authorized only by order of the public prosecutor or the investigating judge as part of preliminary judicial proceedings.
fr: L'interception des communications téléphoniques n'est autorisée que sur ordre du Procureur de la République ou du Juge d'instruction dans le cadre d'une procédure d'information judiciaire.

source: Article 10 of the Constitution states that “the freedoms of opinion and expression, communication, the press, association, assembly, movement, conscience and religion shall be guaranteed to all and may be restricted only for the sake of respect for the freedoms and rights of others and the need to safeguard public order”.
fr: Aux termes de l'article 10 de la Constitution, «les libertés d'opinion et d'expression, de communication, de presse, d'association, de réunion, de circulation, de conscience et de religion sont garanties à tous et ne peuvent être limitées que par le respect des libertés et des droits d'autrui et par l'impératif de sauvegarder l'ordre public».

source: The freedoms of religion and religious association are regulated by Ordinance No. 62-117 of 1 October 1962.
fr: Les libertés de religion et d'associations culturelles sont régies par l'ordonnance no 62-117 du 1er octobre 1962.

source: Ordinance No. 60-133 of 3 October 1960 regulates the formation and dissolution of non-profit associations.
fr: L'ordonnance no 60-133 du 3 octobre 1960 organise la création et la dissolution des associations à but non lucratif.

source: The spread of religious associations other than the traditional religions (Catholicism, Protestantism and Islam) throughout the country demonstrates Madagascar's respect for religious freedom, as recognized under the Covenant:
fr: L'expansion en nombre des associations culturelles, autres que les religions classiques catholiques, protestantes et musulmanes sur tout le territoire national, traduit le respect des libertés religieuses préconisé par le Pacte ainsi rédigé:

source: “Everyone shall have the right to freedom of thought, conscience and religion. This right shall include freedom to have or to adopt a religion or belief of his choice, and freedom, either individually or in community with others and in public or private, to manifest his religion or belief in worship, observance, practice and teaching.”
fr: «Toute personne a droit à la liberté de pensée, de conscience et de religion; ce droit implique la liberté d'avoir ou d'adopter une religion ou une conviction de son choix, ainsi que la liberté de manifester sa religion ou sa conviction, individuellement ou en commun, tant en public qu'en privé, par le culte et l'accomplissement des rites, les pratiques et l'enseignement.».

source: The religious freedoms referred to in article 18 of the Covenant may be restricted only for the sake of respect for the freedoms and rights of others and the need to safeguard public order.
fr: Les libertés religieuses visées à l'article 18 du Pacte ne sont limitées que par le respect des droits et libertés d'autrui, et la sauvegarde de l'ordre public.

source: The Administrative Division of the Supreme Court may, in the event of a legal challenge, review the lawfulness of restrictive measures, suspensions or dissolutions ordered by the Government in respect of religious associations.
fr: La Chambre administrative de la Cour Suprême, en cas de recours, exerce un contrôle de légalité sur les mesures de restrictions, de suspension ou de dissolution décidées par l'administration à l'encontre des associations religieuses.

source: Such judicial control safeguards the exercise and enjoyment of the freedoms recognized in article 18 of the Covenant.
fr: Tel contrôle juridictionnel offre une garantie de protection de l'exercice et de la jouissance des libertés énoncées à l'article 18 du Pacte.

source: Madagascar respects parents' freedom to bring up their children in accordance with their own religious and moral convictions.
fr: Madagascar respecte la liberté des parents de faire assurer l'éducation religieuse et morale de leurs enfants conformément à leurs propres convictions.

source: Since the secular nature of the State prohibits any interference in religious matters, it may not defray any expenses involved in religious observance.
fr: La laïcité de l'État lui interdit toute immixtion dans les affaires religieuses, il en découle qu'il ne doit pas prendre en charge toutes dépenses relatives à l'exercice des cultes

source: The freedoms of opinion and expression are indivisible.
fr: Les libertés d'opinion et d'expression sont inséparables.

source: The former denotes the individual's freedom to think what they believe to be true, while the latter denotes the freedom to express their thoughts to others.
fr: La première exprime la liberté de choisir sa vérité dans sa pensée tandis que la seconde est l'expression de la liberté de révéler sa pensée à autrui.

source: Protection of these freedoms entails prohibiting the suppression of opinions or the expression of opinions.
fr: Pour la protection de ces libertés, il est indispensable de prévoir l'interdiction de sanctionner une opinion ou l'expression d'une opinion.

source: Crimes of conscience do not exist in Malagasy law.
fr: Le délit d'opinion n'existe pas en droit malagasy.

source: Certain restrictions are nonetheless provided for under article 10 of the Constitution, which states that “the freedoms of opinion and expression, communication, the press, association, assembly, movement, conscience and religion shall be guaranteed to all and may be restricted only for the sake of respect for the freedoms and rights of others and the need to safeguard public order”.
fr: Toutefois, l'article 10 de la Constitution prévoit des restrictions en disposant «les libertés d'opinion et d'expression, de communication, de presse, d'association, de réunion, de circulation, de conscience et de religion sont garanties à tous et ne peuvent être limitées que par le respect des libertés et droits d'autrui et par l'impératif de sauvegarder l'ordre public».

source: Article 11 of the Constitution also provides that the right to information shall not be subject to any prior restraint.
fr: L'article 11 de cette Constitution prévoit également le droit à l'information non soumis à aucune contrainte préalable.

source: Article 2, paragraph 1, of Act No. 90-031 of 21 December 1990 stipulates that “everyone has the right to express their opinion and their ideas in the press, regardless of the medium employed”.
fr: L'article 2, alinéa premier, de la loi no 90-031 du 21 décembre 1990 apporte la précision suivante: «Toute personne a le droit d'exprimer son opinion et ses idées par voie de presse quel qu'en soit le support matériel.».

source: The right to freedom of the press and to information are also protected under Ordinance No. 92-039 of 14 September 1992 on audio-visual communications.
fr: Le droit à la liberté de la presse et à l'information est également prévu par l'ordonnance no 92-039 du 14 septembre 1992 sur la communication audiovisuelle.

source: Under article 2, paragraph 2, of Act No. 90-031, “the press has a mandate to publish any opinion and report any event likely to be of interest or educational value to the public, in full freedom and independence of spirit”; while under paragraph 3, “expressions of this freedom shall be restricted only for the sake of respect for the rights and dignity of others”.
fr: L'alinéa 2, article 2, de la loi no 90-031 stipule: «la presse a pour mandat, en toute liberté et indépendance d'esprit, d'émettre toute opinion et de rapporter tout événement susceptible d'intéresser le public et de contribuer à son éducation», tandis que l'alinéa 3 énonce que «les manifestations de cette liberté n'ont d'autres limites que celles qu'impose le respect des droits et de la dignité d'autrui».

source: This legislation gives everyone the right to freedom of expression, which includes the freedom to seek, receive and impart information and ideas of all kinds, regardless of frontiers, either orally, in writing or in print, in the form of art or through any other media of their choice.
fr: Cette mesure législative indique que toute personne a droit à la liberté d'expression englobant la liberté de rechercher, de recevoir et de répandre des informations et des idées de toute nature, sans considération de frontière, sous une forme orale, écrite, imprimée ou artistique, ou par tout autre moyen de son choix.

source: Article 59 provides as follows: “The public has the right to full information that is in conformity with facts and events.
fr: Par ailleurs, l'article 59 de la même loi énonce «le public a droit à une information complète et conformément aux faits et événements.

source: Restrictions on the exercise of the right to freedom of the press and information are justified where there is a need to respect the rights and dignity of others or to safeguard morals and public order.
fr: Les limites de l'exercice du droit à la liberté de presse et à l'information sont justifiées par le respect des droits et de la dignité d'autrui ou encore par la nécessité de sauvegarder la moralité et l'ordre public.

source: Such restrictive measures are in no way contrary to the requirements of the Convention.
fr: Ces mesures restrictives ne sont nullement contraires à celles édictées par le Pacte.

source: The following tables show the progress of the liberalization of the communications sector.
fr: La libéralisation du secteur de la communication est illustrée par les tableaux suivants:

source: Radio stations per province, November 2004
fr: Tableau 47: Nombre des stations de radios par province au mois de novembre 2004

source: Source: Department of Information, Regulation and Media (DIRM), SRR/CSCA (17 November 2004).
fr: Source: DIRM/SRR/CSCA (17/11/04).

source: Television stations per province, November 2004
fr: Tableau 48: Nombre des stations de télévisions par province au mois de novembre 2004

source: Source: Department of Information, Regulation and Media, SRR/CSCA (17 November 2004).
fr: Source: DIRM/SRR/CSCA (17/11/04).

source: Table 49
fr: Tableau 49: Les principaux quotidiens et hebdomadaires

source: Figure 3
fr: Graphique 3: Les principaux quotidiens et hebdomadaires de Madagascar

source: These tables indicate that the era of the State monopoly over the introduction and operation of radio and television is at an end.
fr: Ces tableaux marquent la fin de l'époque où l'État détient le monopole de la création et de l'exploitation de la radio et de la télévision.

source: The advent of satellite broadcasting has further hastened the demise of that monopoly.
fr: La possibilité de recevoir des émissions télévisées par satellite renforce l'élimination du monopole d'État.

source: The Malagasy Telecommunications Monitoring and Regulation Office (OMERT) is responsible for issuing licences to private radio and television stations and supervising and monitoring the use of frequencies in accordance with the law.
fr: L'Office malagasy d'étude et de régulation de la télécommunication (OMERT) est chargé de délivrer les licences d'exploitation sur la communication aux radios et télévisions privées, de contrôler et de vérifier l'utilisation des fréquences suivant les textes en vigueur.

source: Article 20
fr: Interdiction de propagande en faveur de la guerre

source: Prohibition of any propaganda for war and any advocacy of national, racial or religious hatred
fr: Interdiction de tout appel à la haine nationale, raciale ou religieuse

source: Malagasy law prohibits propaganda for war and all incitement to hatred.
fr: Le droit malagasy interdit la propagande en faveur de la guerre ainsi que toute incitation à la haine.

source: The law takes account of the extremely serious nature of incitement to war and does not hold back from imposing the death penalty on those found guilty.
fr: Le législateur, prenant en compte l'extrême gravité d'une incitation à la guerre n'a pas hésité à en punir de la peine capitale les auteurs.

source: The severity of the punishment is intended as a deterrent to anyone tempted to engage in such activities.
fr: La sévérité de la sanction a pour but de dissuader ceux qui sont tentés de se livrer à de tels actes.

source: Under article 91 of the Criminal Code, “any attempt either to incite civil war by arming citizens or inhabitants against one another, or causing them to be so armed, or to bring about destruction, massacre or pillage in one or more communities, shall be punishable by death”.
fr: L'article 91 du Code pénal stipule: «l'attentat dont le but, soit d'exciter à la guerre civile en armant ou portant les citoyens ou habitants à s'armer les uns contre les autres, soit de porter la dévastation, le massacre et le pillage dans une ou plusieurs communes, sera puni de mort».
